## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # azurerm_databricks_workspace.rcm_adb will be created
  + resource "azurerm_databricks_workspace" "rcm_adb" {
      + customer_managed_key_enabled      = false
      + disk_encryption_set_id            = (known after apply)
      + id                                = (known after apply)
      + infrastructure_encryption_enabled = false
      + location                          = "swedencentral"
      + managed_disk_identity             = (known after apply)
      + managed_resource_group_id         = (known after apply)
      + managed_resource_group_name       = (known after apply)
      + name                              = "vj-rcm-dev-adb"
      + public_network_access_enabled     = true
      + resource_group_name               = "vj-rcm-dev-rg"
      + sku                               = "standard"
      + storage_account_identity          = (known after apply)
      + tags                              = {
          + "Environment" = "Staging"
        }
      + workspace_id                      = (known after apply)
      + workspace_url                     = (known after apply)

      + custom_parameters (known after apply)
    }

  # azurerm_key_vault_access_policy.rcm-adf-mi will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adf-mi" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Verify",
          + "Sign",
          + "Purge",
        ]
      + key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + object_id          = "6f0da0b0-27bb-4601-a4ed-81d234b09d39"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_access_policy.rcm-adf-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adf-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "Update",
          + "Create",
          + "Import",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Decrypt",
          + "Encrypt",
          + "UnwrapKey",
          + "WrapKey",
          + "Verify",
          + "Sign",
          + "Purge",
        ]
      + key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + object_id          = "a1ca21ef-2507-4022-b5f3-a5f9c2970bba"
      + secret_permissions = [
          + "Get",
          + "List",
          + "Set",
          + "Delete",
          + "Recover",
          + "Backup",
          + "Restore",
          + "Purge",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_access_policy.rcm-adls-principal will be created
  + resource "azurerm_key_vault_access_policy" "rcm-adls-principal" {
      + id                 = (known after apply)
      + key_permissions    = [
          + "Get",
          + "List",
          + "UnwrapKey",
          + "WrapKey",
        ]
      + key_vault_id       = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + object_id          = "c8df4345-5fc6-42a6-975f-ba96526d3f73"
      + secret_permissions = [
          + "Get",
          + "List",
        ]
      + tenant_id          = "314aacf1-9610-4c50-bf5a-8ce5f8010819"
    }

  # azurerm_key_vault_secret.rcm_adls_kv will be created
  + resource "azurerm_key_vault_secret" "rcm_adls_kv" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + name                    = "vj-adls-access-key-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.rcm_sqldb_kv will be created
  + resource "azurerm_key_vault_secret" "rcm_sqldb_kv" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.KeyVault/vaults/vj-rcm-dev-kv"
      + name                    = "vj-sqldb-access-key-dev"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_mssql_database.rcm_db["vj-rcm-hos-a"] is tainted, so must be replaced
-/+ resource "azurerm_mssql_database" "rcm_db" {
      ~ auto_pause_delay_in_minutes                                = 0 -> (known after apply)
      ~ collation                                                  = "SQL_Latin1_General_CP1_CI_AS" -> (known after apply)
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      ~ id                                                         = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Sql/servers/vjrcmdevsql/databases/vj-rcm-hos-a" -> (known after apply)
      ~ ledger_enabled                                             = false -> (known after apply)
      + license_type                                               = (known after apply)
      ~ maintenance_configuration_name                             = "SQL_Default" -> (known after apply)
      ~ max_size_gb                                                = 250 -> (known after apply)
      ~ min_capacity                                               = 0 -> (known after apply)
        name                                                       = "vj-rcm-hos-a"
      ~ read_replica_count                                         = 0 -> (known after apply)
      ~ read_scale                                                 = false -> (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      ~ sku_name                                                   = "S0" -> (known after apply)
      - tags                                                       = {} -> null
      ~ zone_redundant                                             = false -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ long_term_retention_policy (known after apply)
      - long_term_retention_policy {
          - immutable_backups_enabled = false -> null
          - monthly_retention         = "PT0S" -> null
          - week_of_year              = 1 -> null
          - weekly_retention          = "PT0S" -> null
          - yearly_retention          = "PT0S" -> null
        }

      ~ short_term_retention_policy (known after apply)
      - short_term_retention_policy {
          - backup_interval_in_hours = 24 -> null
          - retention_days           = 7 -> null
        }

      ~ threat_detection_policy (known after apply)
      - threat_detection_policy {
          - disabled_alerts            = [] -> null
          - email_account_admins       = "Disabled" -> null
          - email_addresses            = [] -> null
          - retention_days             = 0 -> null
          - state                      = "Disabled" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_mssql_database.rcm_db["vj-rcm-hos-b"] is tainted, so must be replaced
-/+ resource "azurerm_mssql_database" "rcm_db" {
      ~ auto_pause_delay_in_minutes                                = 0 -> (known after apply)
      ~ collation                                                  = "SQL_Latin1_General_CP1_CI_AS" -> (known after apply)
      + creation_source_database_id                                = (known after apply)
      + enclave_type                                               = (known after apply)
      ~ id                                                         = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Sql/servers/vjrcmdevsql/databases/vj-rcm-hos-b" -> (known after apply)
      ~ ledger_enabled                                             = false -> (known after apply)
      + license_type                                               = (known after apply)
      ~ maintenance_configuration_name                             = "SQL_Default" -> (known after apply)
      ~ max_size_gb                                                = 250 -> (known after apply)
      ~ min_capacity                                               = 0 -> (known after apply)
        name                                                       = "vj-rcm-hos-b"
      ~ read_replica_count                                         = 0 -> (known after apply)
      ~ read_scale                                                 = false -> (known after apply)
      + restore_point_in_time                                      = (known after apply)
      + sample_name                                                = (known after apply)
      + secondary_type                                             = (known after apply)
      ~ sku_name                                                   = "S0" -> (known after apply)
      - tags                                                       = {} -> null
      ~ zone_redundant                                             = false -> (known after apply)
        # (8 unchanged attributes hidden)

      ~ long_term_retention_policy (known after apply)
      - long_term_retention_policy {
          - immutable_backups_enabled = false -> null
          - monthly_retention         = "PT0S" -> null
          - week_of_year              = 1 -> null
          - weekly_retention          = "PT0S" -> null
          - yearly_retention          = "PT0S" -> null
        }

      ~ short_term_retention_policy (known after apply)
      - short_term_retention_policy {
          - backup_interval_in_hours = 24 -> null
          - retention_days           = 7 -> null
        }

      ~ threat_detection_policy (known after apply)
      - threat_detection_policy {
          - disabled_alerts            = [] -> null
          - email_account_admins       = "Disabled" -> null
          - email_addresses            = [] -> null
          - retention_days             = 0 -> null
          - state                      = "Disabled" -> null
            # (2 unchanged attributes hidden)
        }
    }

  # azurerm_storage_container.rcm_container["tfstate"] will be destroyed
  # (because key ["tfstate"] is not in for_each map)
  - resource "azurerm_storage_container" "rcm_container" {
      - container_access_type             = "private" -> null
      - default_encryption_scope          = "$account-encryption-key" -> null
      - encryption_scope_override_enabled = true -> null
      - has_immutability_policy           = false -> null
      - has_legal_hold                    = false -> null
      - id                                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage/blobServices/default/containers/tfstate" -> null
      - metadata                          = {} -> null
      - name                              = "tfstate" -> null
      - resource_manager_id               = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage/blobServices/default/containers/tfstate" -> null
      - storage_account_id                = "/subscriptions/71458d97-9dd7-48da-8513-2222c61f78bf/resourceGroups/vj-rcm-dev-rg/providers/Microsoft.Storage/storageAccounts/vjrcmdevstorage" -> null
    }

Plan: 8 to add, 0 to change, 3 to destroy.
```
</details>